In [1]:
profile = {
    "name" : ["kavita","rohini"],
    "roll_no":["101","102"]
}

In [2]:
type(profile)

dict

In [3]:
import pandas as pd

In [4]:
data = pd.DataFrame(profile)

In [5]:
data

     name roll_no
0  kavita     101
1  rohini     102

In [6]:
row =["r1","r2"]

In [7]:
data2 = pd .DataFrame(profile,row)

In [8]:
data2

      name roll_no
r1  kavita     101
r2  rohini     102

In [9]:
data2.columns

Index(['name', 'roll_no'], dtype='object')

In [10]:
data2.shape

(2, 2)

In [11]:
path = r"D:\python_notes2\theroy\tips.csv"
print(path)

D:\python_notes2\theroy\tips.csv

In [12]:
import pandas as pd

In [13]:
data = pd.read_csv(path)
data

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [14]:
data.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [15]:
data.shape

(244, 7)

In [16]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [17]:
data.values

array([[16.99, 1.01, 'Female', ..., 'Sun', 'Dinner', 2],
       [10.34, 1.66, 'Male', ..., 'Sun', 'Dinner', 3],
       [21.01, 3.5, 'Male', ..., 'Sun', 'Dinner', 3],
       ...,
       [22.67, 2.0, 'Male', ..., 'Sat', 'Dinner', 2],
       [17.82, 1.75, 'Male', ..., 'Sat', 'Dinner', 2],
       [18.78, 3.0, 'Female', ..., 'Thur', 'Dinner', 2]],
      shape=(244, 7), dtype=object)

In [18]:
data.index

RangeIndex(start=0, stop=244, step=1)

In [19]:
data.dtypes

total_bill    float64
tip           float64
sex            object
smoker         object
day            object
time           object
size            int64
dtype: object

In [20]:
data.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [21]:
data["day"]

0       Sun
1       Sun
2       Sun
3       Sun
4       Sun
       ...
239     Sat
240     Sat
241     Sat
242     Sat
243    Thur
Name: day, Length: 244, dtype: object

In [22]:
data["day"].unique

<bound method Series.unique of 0       Sun
1       Sun
2       Sun
3       Sun
4       Sun
       ...
239     Sat
240     Sat
241     Sat
242     Sat
243    Thur
Name: day, Length: 244, dtype: object>

In [23]:
data["day"]=="sun"

0      False
1      False
2      False
3      False
4      False
       ...
239    False
240    False
241    False
242    False
243    False
Name: day, Length: 244, dtype: bool

In [24]:
data["day"]

0       Sun
1       Sun
2       Sun
3       Sun
4       Sun
       ...
239     Sat
240     Sat
241     Sat
242     Sat
243    Thur
Name: day, Length: 244, dtype: object

In [27]:
path2= r"C:\Users\DELL-PC\Desktop\Employee_Salary_50Rows_50Cols.csv"
print(path2)

C:\Users\DELL-PC\Desktop\Employee_Salary_50Rows_50Cols.csv

In [29]:
data2 = pd.read_csv(path2)
print(data2)

    Employee ID  Basic Salary (Month 1)  HRA (Month 1)  DA (Month 1)  \
0          5741                   77253          24769         32331
1          2307                   22996          56865         76628
2          4814                   73608          63792         23179
3          2654                   32578          60617         54501
4          7227                   51162          37766         23051
5          5554                   59660          70397         60230
6          8428                   49415          56502         56355
7          6977                   52492          58915         60414
8          3664                   55758          31791         64676
9          7065                   36268          63096         63561
10         6820                   33557          54151         51649
11         4432                   66185          34076         33486
12         5374                   47409          59087         29035
13         2169                   39142          22142         38012
14         3803                   65163          42978         76429
15         9751                   52077          29317         57842
16         5010                   75864          51807         71662
17         3677                   28696          58907         34823
18         8573                   76358          34237         25681
19         7216                   24653          54621         78243
20         5422                   72957          30182         55152
21         4598                   77243          37613         68033
22         6313                   62972          47483         34713
23         1916                   20417          46872         21566
24         4752                   35517          39115         37104
25         1525                   25977          66606         36267
26         6168                   73038          28440         26027
27         7572                   61337          72570         55629
28         5386                   43252          74999         75392
29         2084                   66182          29283         70748
30         4456                   22122          31932         59478
31         6155                   74316          51423         71690
32         4483                   35567          26285         23252
33         9179                   37262          34827         74858
34         7482                   30955          33886         72983
35         8517                   38749          76850         55103
36         3340                   41028          37656         67762
37         5339                   46014          61642         28118
38         3287                   72485          20554         34664
39         5040                   39581          32344         29825
40         9830                   68556          36951         67525
41         5304                   78513          79416         49987
42         8019                   32489          21174         64351
43         7543                   66603          62633         71912
44         6930                   52619          33018         59911
45         4593                   64352          40493         47918
46         3266                   57286          64459         48715
47         9348                   23576          20763         62165
48         9085                   71890          59597         60571
49         2489                   32290          27913         75849

    Bonuses (Month 1)  Provident Fund (Month 1)  Tax (Month 1)  \
0                7591                     11626          11156
1                2812                      4390           2265
2                7261                      2104           8756
3                3067                      7807           6379
4                1609                      6593          10897
5                5879                      8499           7347
6                5197                      8685           3692
7                2601                      9501           3752
8                7288                     11012           2440
9                3908                      4725           2725
10               3853                      9801           3599
11               3280                      3025          11459
12               5708                      8286           8931
13               2841                     10808           6729
14               6822                     11998           9015
15               6180                      6402           8786
16               3815                      2793           2752
17               5255                      9291           2152
18               1823                      4293           4017
19               1098                      7916           7185
20               3676                      8401          11608
21               1967                      2480           7488
22               3636                      6067           8819
23               2908                     10872           7675
24               7970                      7161           8438
25               3914                      8492          10412
26               7940                      7432           4007
27               7511                      2319           8266
28               2423                      4885           5875
29               1908                     10622           7978
30               3606                      5619          11265
31               5735                      5695           4664
32               4218                     11367          11005
33               3200                     11244           3009
34               2578                      4067           2699
35               3816                      8732           6327
36               4414                     11911           3462
37               6580                      2500           5963
38               3067                     11967           7004
39               5237                      5937           2930
40               7621                     11159           4999
41               2173                      7183           4954
42               1033                      6076           5707
43               1306                      8147           6190
44               2636                      6308          10571
45               7050                      3898           3556
46               2484                      8221           7875
47               2285                     10283           9688
48               6222                      6990          10328
49               4218                      5532           9488

    Other Allowances (Month 1)  Medical Insurance (Month 1)  \
0                         2777                         4927
1                         3136                         5532
2                         2126                         7902
3                         7512                         4251
4                         5616                         6391
5                         1242                         6194
6                         1215                         1734
7                         2109                         3495
8                         6957                         4781
9                         5613                         6284
10                        4589                         6914
11                        1833                         7549
12                        2521                         4986
13                        2377                         7395
14                        2359                         6047
15                        4073                         4702
16                        1815                         6129
17                        1066                         6698
18                        5829                         6980
19                        2081                         4168
20                        6196                         7252
21                        7611                         4517
22                        6900                         3620
23                        6209                         7877
24                        6740                         7814
25                        1401                         6547
26                        1349                         4776
27                        7405                         6843
28                        5853                         3605
29                        1594                         4060
30                        1852                         5064
31                        4696                         1603
32                        7880                         5021
33                        2238                         7162
34                        4468                         1641
35                        4137                         6364
36                        2539                         4618
37                        4051                         5004
38                        6838                         6811
39                        7598                         7572
40                        6568                         3749
41                        7381                         1662
42                        6681                         3820
43                        7318                         5380
44                        2652                         3932
45                        7973                         7211
46                        6008                         1236
47                        7978                         5061
48                        5606                         2694
49                        7754                         7401

    Travel Allowance (Month 1)  ...  Basic Salary (Month 5)  HRA (Month 5)  \
0                         2711  ...                   50540          26462
1                         5784  ...                   52002          32061
2                         6166  ...                   65734          64173
3                         1647  ...                   71404          41710
4                         1269  ...                   52819          68854
5                         3239  ...                   20340          40202
6                         3899  ...                   38085          47597
7                         1055  ...                   44645          38369
8                         6802  ...                   71820          43562
9                         6549  ...                   39361          47261
10                        6707  ...                   45924          21913
11                        5398  ...                   27724          35635
12                        6206  ...                   75043          49088
13                        4746  ...                   76505          73525
14                        2140  ...                   76759          28696
15                        1618  ...                   52421          37598
16                        7421  ...                   65838          69494
17                        3814  ...                   62599          30755
18                        4145  ...                   78845          72021
19                        7872  ...                   55164          55235
20                        7836  ...                   53896          71313
21                        3228  ...                   50917          43853
22                        3222  ...                   44135          58777
23                        6680  ...                   61760          73737
24                        7024  ...                   30329          72926
25                        3448  ...                   58163          58411
26                        1414  ...                   25748          38335
27                        3941  ...                   54975          73496
28                        7604  ...                   33203          72851
29                        6771  ...                   39301          28345
30                        2152  ...                   47502          30901
31                        7547  ...                   33470          32450
32                        2258  ...                   44315          78031
33                        6705  ...                   57435          79012
34                        6596  ...                   57132          58530
35                        4977  ...                   64882          26436
36                        2731  ...                   49913          23313
37                        5866  ...                   21314          76664
38                        6265  ...                   51571          24183
39                        7635  ...                   75405          31140
40                        6361  ...                   47073          23543
41                        4994  ...                   22472          54981
42                        3556  ...                   34701          67655
43                        6104  ...                   28989          47448
44                        6762  ...                   37309          50426
45                        1375  ...                   28684          65624
46                        6607  ...                   42659          63496
47                        2354  ...                   21164          26726
48                        6362  ...                   23000          78777
49                        2561  ...                   73427          28413

    DA (Month 5)  Bonuses (Month 5)  Provident Fund (Month 5)  Tax (Month 5)  \
0          72613               6918                      9692           7246
1          78285               5441                      2962          10584
2          48218               7604                      4937           3753
3          57083               1781                     10653           2697
4          42666               1439                      3600           9161
5          49146               3948                      6419           3674
6          39644               4966                      3260           7916
7          73509               7437                      8437           7980
8          65982               7654                     10796          11729
9          25626               1950                      4321           7707
10         68325               6030                      5232           9365
11         40013               1958                      4999           8116
12         52027               2370                      3354          11263
13         25700               4596                      3923           5882
14         36362               2198                      7277           6055
15         41159               7785                      6646           7533
16         35344               4516                      3494           3559
17         48842               3876                      5490           4480
18         35685               5054                      8322           3847
19         60373               2250                      6546           3369
20         73903               6904                      6247           4735
21         45098               2229                      4932           2579
22         52332               7329                      5201          10954
23         45844               1613                     11697          11303
24         64961               3492                     11884           2660
25         36962               7658                      3228           2357
26         45101               2124                      8868           5267
27         71854               7037                      2916           5594
28         28551               3791                      4907           7301
29         31646               6970                      2029          11385
30         77969               4391                     10078           8204
31         46822               6711                     11078          10849
32         44998               4026                      5056           9303
33         53870               7557                     11363           4415
34         58186               7212                      3641           3730
35         76944               2867                      4201           6923
36         43617               6772                      5262           6488
37         71137               7287                      2145           9767
38         42038               3264                      7327           6536
39         75092               6387                     11146           4967
40         77071               7997                      4470           4250
41         33068               6985                      8112           2230
42         28598               2730                      2359          11661
43         74437               1859                     10381           3928
44         23282               1817                      4862           2646
45         67606               1480                      4611           3699
46         64321               6254                      8305           4435
47         46439               4377                      2587          11128
48         30758               5033                      4301           8704
49         26786               4173                     11839          11931

    Other Allowances (Month 5)  Medical Insurance (Month 5)  \
0                         2664                         4036
1                         1277                         7873
2                         1789                         5295
3                         2882                         2731
4                         2901                         7870
5                         2085                         1715
6                         3061                         3020
7                         1932                         5619
8                         6227                         1696
9                         3555                         3810
10                        5851                         4518
11                        6680                         2158
12                        1252                         7519
13                        2719                         7641
14                        7237                         7910
15                        5483                         5734
16                        1008                         2748
17                        4372                         6046
18                        2974                         5092
19                        3538                         1647
20                        4046                         2039
21                        5529                         7579
22                        7229                         7520
23                        1510                         4563
24                        2761                         7847
25                        1528                         2619
26                        6264                         7530
27                        5716                         7934
28                        1487                         1179
29                        4207                         7969
30                        3877                         5473
31                        3173                         6411
32                        1365                         3156
33                        1985                         7202
34                        5609                         7386
35                        7092                         4629
36                        4017                         7746
37                        2083                         6303
38                        3139                         6374

In [30]:
data2.columns

Index(['Employee ID', 'Basic Salary (Month 1)', 'HRA (Month 1)',
       'DA (Month 1)', 'Bonuses (Month 1)', 'Provident Fund (Month 1)',
       'Tax (Month 1)', 'Other Allowances (Month 1)',
       'Medical Insurance (Month 1)', 'Travel Allowance (Month 1)',
       'Meal Allowance (Month 1)', 'Basic Salary (Month 2)', 'HRA (Month 2)',
       'DA (Month 2)', 'Bonuses (Month 2)', 'Provident Fund (Month 2)',
       'Tax (Month 2)', 'Other Allowances (Month 2)',
       'Medical Insurance (Month 2)', 'Travel Allowance (Month 2)',
       'Meal Allowance (Month 2)', 'Basic Salary (Month 3)', 'HRA (Month 3)',
       'DA (Month 3)', 'Bonuses (Month 3)', 'Provident Fund (Month 3)',
       'Tax (Month 3)', 'Other Allowances (Month 3)',
       'Medical Insurance (Month 3)', 'Travel Allowance (Month 3)',
       'Meal Allowance (Month 3)', 'Basic Salary (Month 4)', 'HRA (Month 4)',
       'DA (Month 4)', 'Bonuses (Month 4)', 'Provident Fund (Month 4)',
       'Tax (Month 4)', 'Other Allowances (Month 4)',
       'Medical Insurance (Month 4)', 'Travel Allowance (Month 4)',
       'Meal Allowance (Month 4)', 'Basic Salary (Month 5)', 'HRA (Month 5)',
       'DA (Month 5)', 'Bonuses (Month 5)', 'Provident Fund (Month 5)',
       'Tax (Month 5)', 'Other Allowances (Month 5)',
       'Medical Insurance (Month 5)', 'Travel Allowance (Month 5)',
       'Meal Allowance (Month 5)'],
      dtype='object')

In [31]:
data2.shape

(50, 51)

In [32]:
data2.columns

Index(['Employee ID', 'Basic Salary (Month 1)', 'HRA (Month 1)',
       'DA (Month 1)', 'Bonuses (Month 1)', 'Provident Fund (Month 1)',
       'Tax (Month 1)', 'Other Allowances (Month 1)',
       'Medical Insurance (Month 1)', 'Travel Allowance (Month 1)',
       'Meal Allowance (Month 1)', 'Basic Salary (Month 2)', 'HRA (Month 2)',
       'DA (Month 2)', 'Bonuses (Month 2)', 'Provident Fund (Month 2)',
       'Tax (Month 2)', 'Other Allowances (Month 2)',
       'Medical Insurance (Month 2)', 'Travel Allowance (Month 2)',
       'Meal Allowance (Month 2)', 'Basic Salary (Month 3)', 'HRA (Month 3)',
       'DA (Month 3)', 'Bonuses (Month 3)', 'Provident Fund (Month 3)',
       'Tax (Month 3)', 'Other Allowances (Month 3)',
       'Medical Insurance (Month 3)', 'Travel Allowance (Month 3)',
       'Meal Allowance (Month 3)', 'Basic Salary (Month 4)', 'HRA (Month 4)',
       'DA (Month 4)', 'Bonuses (Month 4)', 'Provident Fund (Month 4)',
       'Tax (Month 4)', 'Other Allowances (Month 4)',
       'Medical Insurance (Month 4)', 'Travel Allowance (Month 4)',
       'Meal Allowance (Month 4)', 'Basic Salary (Month 5)', 'HRA (Month 5)',
       'DA (Month 5)', 'Bonuses (Month 5)', 'Provident Fund (Month 5)',
       'Tax (Month 5)', 'Other Allowances (Month 5)',
       'Medical Insurance (Month 5)', 'Travel Allowance (Month 5)',
       'Meal Allowance (Month 5)'],
      dtype='object')

In [33]:
data2.dtypes

Employee ID                    int64
Basic Salary (Month 1)         int64
HRA (Month 1)                  int64
DA (Month 1)                   int64
Bonuses (Month 1)              int64
Provident Fund (Month 1)       int64
Tax (Month 1)                  int64
Other Allowances (Month 1)     int64
Medical Insurance (Month 1)    int64
Travel Allowance (Month 1)     int64
Meal Allowance (Month 1)       int64
Basic Salary (Month 2)         int64
HRA (Month 2)                  int64
DA (Month 2)                   int64
Bonuses (Month 2)              int64
Provident Fund (Month 2)       int64
Tax (Month 2)                  int64
Other Allowances (Month 2)     int64
Medical Insurance (Month 2)    int64
Travel Allowance (Month 2)     int64
Meal Allowance (Month 2)       int64
Basic Salary (Month 3)         int64
HRA (Month 3)                  int64
DA (Month 3)                   int64
Bonuses (Month 3)              int64
Provident Fund (Month 3)       int64
Tax (Month 3)                  int64
Other Allowances (Month 3)     int64
Medical Insurance (Month 3)    int64
Travel Allowance (Month 3)     int64
Meal Allowance (Month 3)       int64
Basic Salary (Month 4)         int64
HRA (Month 4)                  int64
DA (Month 4)                   int64
Bonuses (Month 4)              int64
Provident Fund (Month 4)       int64
Tax (Month 4)                  int64
Other Allowances (Month 4)     int64
Medical Insurance (Month 4)    int64
Travel Allowance (Month 4)     int64
Meal Allowance (Month 4)       int64
Basic Salary (Month 5)         int64
HRA (Month 5)                  int64
DA (Month 5)                   int64
Bonuses (Month 5)              int64
Provident Fund (Month 5)       int64
Tax (Month 5)                  int64
Other Allowances (Month 5)     int64
Medical Insurance (Month 5)    int64
Travel Allowance (Month 5)     int64
Meal Allowance (Month 5)       int64
dtype: object

In [35]:
data2.index

RangeIndex(start=0, stop=50, step=1)

In [38]:
data2.dtypes

Employee ID                    int64
Basic Salary (Month 1)         int64
HRA (Month 1)                  int64
DA (Month 1)                   int64
Bonuses (Month 1)              int64
Provident Fund (Month 1)       int64
Tax (Month 1)                  int64
Other Allowances (Month 1)     int64
Medical Insurance (Month 1)    int64
Travel Allowance (Month 1)     int64
Meal Allowance (Month 1)       int64
Basic Salary (Month 2)         int64
HRA (Month 2)                  int64
DA (Month 2)                   int64
Bonuses (Month 2)              int64
Provident Fund (Month 2)       int64
Tax (Month 2)                  int64
Other Allowances (Month 2)     int64
Medical Insurance (Month 2)    int64
Travel Allowance (Month 2)     int64
Meal Allowance (Month 2)       int64
Basic Salary (Month 3)         int64
HRA (Month 3)                  int64
DA (Month 3)                   int64
Bonuses (Month 3)              int64
Provident Fund (Month 3)       int64
Tax (Month 3)                  int64
Other Allowances (Month 3)     int64
Medical Insurance (Month 3)    int64
Travel Allowance (Month 3)     int64
Meal Allowance (Month 3)       int64
Basic Salary (Month 4)         int64
HRA (Month 4)                  int64
DA (Month 4)                   int64
Bonuses (Month 4)              int64
Provident Fund (Month 4)       int64
Tax (Month 4)                  int64
Other Allowances (Month 4)     int64
Medical Insurance (Month 4)    int64
Travel Allowance (Month 4)     int64
Meal Allowance (Month 4)       int64
Basic Salary (Month 5)         int64
HRA (Month 5)                  int64
DA (Month 5)                   int64
Bonuses (Month 5)              int64
Provident Fund (Month 5)       int64
Tax (Month 5)                  int64
Other Allowances (Month 5)     int64
Medical Insurance (Month 5)    int64
Travel Allowance (Month 5)     int64
Meal Allowance (Month 5)       int64
dtype: object

In [39]:
data2["Employee ID"]

0     5741
1     2307
2     4814
3     2654
4     7227
5     5554
6     8428
7     6977
8     3664
9     7065
10    6820
11    4432
12    5374
13    2169
14    3803
15    9751
16    5010
17    3677
18    8573
19    7216
20    5422
21    4598
22    6313
23    1916
24    4752
25    1525
26    6168
27    7572
28    5386
29    2084
30    4456
31    6155
32    4483
33    9179
34    7482
35    8517
36    3340
37    5339
38    3287
39    5040
40    9830
41    5304
42    8019
43    7543
44    6930
45    4593
46    3266
47    9348
48    9085
49    2489
Name: Employee ID, dtype: int64

In [40]:
data2["Employee ID"].unique

<bound method Series.unique of 0     5741
1     2307
2     4814
3     2654
4     7227
5     5554
6     8428
7     6977
8     3664
9     7065
10    6820
11    4432
12    5374
13    2169
14    3803
15    9751
16    5010
17    3677
18    8573
19    7216
20    5422
21    4598
22    6313
23    1916
24    4752
25    1525
26    6168
27    7572
28    5386
29    2084
30    4456
31    6155
32    4483
33    9179
34    7482
35    8517
36    3340
37    5339
38    3287
39    5040
40    9830
41    5304
42    8019
43    7543
44    6930
45    4593
46    3266
47    9348
48    9085
49    2489
Name: Employee ID, dtype: int64>

In [41]:
data2["Basic Salary (Month 1)"]

0     77253
1     22996
2     73608
3     32578
4     51162
5     59660
6     49415
7     52492
8     55758
9     36268
10    33557
11    66185
12    47409
13    39142
14    65163
15    52077
16    75864
17    28696
18    76358
19    24653
20    72957
21    77243
22    62972
23    20417
24    35517
25    25977
26    73038
27    61337
28    43252
29    66182
30    22122
31    74316
32    35567
33    37262
34    30955
35    38749
36    41028
37    46014
38    72485
39    39581
40    68556
41    78513
42    32489
43    66603
44    52619
45    64352
46    57286
47    23576
48    71890
49    32290
Name: Basic Salary (Month 1), dtype: int64

In [42]:
data2["Employee ID"]

0     5741
1     2307
2     4814
3     2654
4     7227
5     5554
6     8428
7     6977
8     3664
9     7065
10    6820
11    4432
12    5374
13    2169
14    3803
15    9751
16    5010
17    3677
18    8573
19    7216
20    5422
21    4598
22    6313
23    1916
24    4752
25    1525
26    6168
27    7572
28    5386
29    2084
30    4456
31    6155
32    4483
33    9179
34    7482
35    8517
36    3340
37    5339
38    3287
39    5040
40    9830
41    5304
42    8019
43    7543
44    6930
45    4593
46    3266
47    9348
48    9085
49    2489
Name: Employee ID, dtype: int64

In [44]:
path3 =r"C:\Users\DELL-PC\Desktop\sales.xlsx"
print(path3)

C:\Users\DELL-PC\Desktop\sales.xlsx

In [46]:
data3 = pd.read_excel(path3)
print(data3)

   Sale_ID       Date   Region Store_ID Product_ID        Category  \
0     S001 2024-01-01    North    ST001       P006  Home Appliance
1     S002 2024-01-28     West    ST002       P009        Clothing
2     S003 2024-04-20  Central    ST005       P007       Furniture
3     S004 2024-02-18    South    ST004       P010       Furniture
4     S005 2024-04-03    South    ST004       P004       Furniture
5     S006 2024-01-11    South    ST004       P009        Clothing
6     S007 2024-04-04    South    ST004       P001     Electronics
7     S008 2024-02-28     East    ST003       P010       Furniture
8     S009 2024-04-28  Central    ST005       P005        Clothing
9     S010 2024-03-09    North    ST001       P007       Furniture
10    S011 2024-04-13    North    ST001       P002     Electronics
11    S012 2024-04-23    North    ST001       P010       Furniture
12    S013 2024-03-19  Central    ST005       P008     Electronics
13    S014 2024-04-15    South    ST004       P007       Furniture
14    S015 2024-04-30  Central    ST005       P009        Clothing
15    S016 2024-01-22  Central    ST005       P001     Electronics
16    S017 2024-03-30    North    ST001       P007       Furniture
17    S018 2024-02-15     West    ST002       P006  Home Appliance
18    S019 2024-03-24  Central    ST005       P008     Electronics
19    S020 2024-01-26     West    ST002       P002     Electronics

    Units_Sold  Sales_Amount    Profit
0            7          1750    399.16
1            9           900    248.08
2            4         20000   5406.52
3            6          4800   1228.48
4           18         72000  11674.79
5            2           200     52.17
6            5          7500   2103.42
7            9          7200   1216.47
8            8          1600    241.60
9            9         45000  10934.85
10           5          7500   1279.72
11          18         14400   1564.19
12          11         33000   4359.30
13          18         90000  24736.26
14           6           600    167.83
15          16         24000   7191.18
16           4         20000   2773.92
17          13          3250    945.00
18           5         15000   2878.96
19          20         30000   5456.09

In [48]:
data3.columns

Index(['Sale_ID', 'Date', 'Region', 'Store_ID', 'Product_ID', 'Category',
       'Units_Sold', 'Sales_Amount', 'Profit'],
      dtype='object')

In [53]:
data3["Region"].unique()

array(['North', 'West', 'Central', 'South', 'East'], dtype=object)

In [54]:
data3["Product_ID"]

0     P006
1     P009
2     P007
3     P010
4     P004
5     P009
6     P001
7     P010
8     P005
9     P007
10    P002
11    P010
12    P008
13    P007
14    P009
15    P001
16    P007
17    P006
18    P008
19    P002
Name: Product_ID, dtype: object

In [57]:
data3.query("Region =='West'")

,Sale_ID,Date,Region,Store_ID,Product_ID,Category,Units_Sold,Sales_Amount,Profit
1,S002,2024-01-28,West,ST002,P009,Clothing,9,900,248.08
17,S018,2024-02-15,West,ST002,P006,Home Appliance,13,3250,945.00
19,S020,2024-01-26,West,ST002,P002,Electronics,20,30000,5456.09

In [60]:
data3.query("Product_ID == 'P009'")

,Sale_ID,Date,Region,Store_ID,Product_ID,Category,Units_Sold,Sales_Amount,Profit
1,S002,2024-01-28,West,ST002,P009,Clothing,9,900,248.08
5,S006,2024-01-11,South,ST004,P009,Clothing,2,200,52.17
14,S015,2024-04-30,Central,ST005,P009,Clothing,6,600,167.83

In [61]:
data3["Region"]

0       North
1        West
2     Central
3       South
4       South
5       South
6       South
7        East
8     Central
9       North
10      North
11      North
12    Central
13      South
14    Central
15    Central
16      North
17       West
18    Central
19       West
Name: Region, dtype: object

In [63]:
data3.query("Product_ID =='P002' and  Region == 'East'")

Empty DataFrame
Columns: [Sale_ID, Date, Region, Store_ID, Product_ID, Category, Units_Sold, Sales_Amount, Profit]
Index: []

In [65]:
data3.columns

Index(['Sale_ID', 'Date', 'Region', 'Store_ID', 'Product_ID', 'Category',
       'Units_Sold', 'Sales_Amount', 'Profit'],
      dtype='object')

In [67]:
data3["Sales_Amount"]

0      1750
1       900
2     20000
3      4800
4     72000
5       200
6      7500
7      7200
8      1600
9     45000
10     7500
11    14400
12    33000
13    90000
14      600
15    24000
16    20000
17     3250
18    15000
19    30000
Name: Sales_Amount, dtype: int64

In [69]:
data3.query("Region == 'West' and Sales_Amount >= 3250")

,Sale_ID,Date,Region,Store_ID,Product_ID,Category,Units_Sold,Sales_Amount,Profit
17,S018,2024-02-15,West,ST002,P006,Home Appliance,13,3250,945.00
19,S020,2024-01-26,West,ST002,P002,Electronics,20,30000,5456.09

In [70]:
data3.head(4)

,Sale_ID,Date,Region,Store_ID,Product_ID,Category,Units_Sold,Sales_Amount,Profit
0,S001,2024-01-01,North,ST001,P006,Home Appliance,7,1750,399.16
1,S002,2024-01-28,West,ST002,P009,Clothing,9,900,248.08
2,S003,2024-04-20,Central,ST005,P007,Furniture,4,20000,5406.52
3,S004,2024-02-18,South,ST004,P010,Furniture,6,4800,1228.48

In [84]:
data3.sort_values( by =  "Sales_Amount", ascending = False)  \ 
        .head(2)

SyntaxError: unexpected character after line continuation character (2822144593.py, line 1)

In [83]:
data3.sort_values( by  = "sales_Amount" , ascending= True ) \
    .head(4)

KeyError: 'sales_Amount'